// --створити масив з:
// - з 5 числових значень
let arrNum = [1, 5, 8, 44, 95];
console.log(arrNum);
// - з 5 стічкових значень
let arrStr = ['cat', 'dol', 'car', 'house', 'lorry'];
console.log(arrStr);
// - з 5 значень стрічкового, числового та булевого типу
let arrMix = [1 ,565, 'hello', true, false];
console.log(arrMix);
// - та вивести його в консоль
//
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
 let arr1 = [];
 arr1[0] = 1;
 arr1[1] = 89;
 arr1[2] = 55;
 arr1[3] = true;
 arr1[4] = false;
 arr1[5] = 'no';
 arr1[6] = 'yes';
 console.log(arr1);
//
//
//
let arr2 = [2,17,13,6,22,31,45,66,100,-18];
// 1. перебрати його циклом while
let i = 0;
while (i < arr2.length){
 console.log(arr2[i]);
 i++;
}
//     2. перебрати його циклом for
for (let j = 0; j < arr2.length; j++) {
 console.log(arr2[j]);
}
//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
let a = 0;
while (a < arr2.length){
 if(a % 2 === 1) {
  console.log(arr2[a]);
 }
 a++
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом

for (let j = 0; j < arr2.length; j++) {
 if(j % 2 === 1){
  console.log(arr2[j]);
 }
}

// 5. перебрати циклом while та вивести  числа тільки парні  значення
let b = 0;
while (b<arr2.length){
 if (arr2[b] %2 === 0){
  console.log(arr2[b])
 }
 b++
}

// 6. перебрати циклом for та вивести  числа тільки парні  значення
for (let j = 0; j < arr2.length; j++) {
 if(arr2[j] %2 === 0){
  console.log(arr2[j])
 }
}

// 7. замінити кожне число кратне 3 на слово "okten"
for (let j = 0; j < arr2.length; j++) {
 const arr2Element = arr2[j];
 if(arr2[j] %3 === 0){
  arr2[j] = "okten"
  console.log(arr2)
 }
}

// 8. вивести масив в зворотньому порядку.
let arr3 = [2,17,13,6,22,31,45,66,100,-18];
for (let c = arr3.length-1; c >= 0; c--) {
 console.log(arr3[c]);
}

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
let arr4 = [2,17,13,6,22,31,45,66,100,-18];

//1.перебрати його циклом for (ззаду на перед)

for (let s = arr4.length - 1; s >= 0; s--) {
 console.log(arr4[s]);
}

//2.перебрати його циклом while (ззаду на перед)

let i2 = arr4.length;
while (i2--){
 console.log(arr4[i2]);
}

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом (ззаду на перед)
 let n = arr4.length;
 while (n--){
 if(n % 2 === 1) {
  console.log(arr4[n]);
 }
}

// 4. перебрати циклом for та вивести  числа тільки з непарним індексом (ззаду на перед)

for (let m = arr4.length; m >= 0; m--) {
 const nElement = arr4[m];
 if( m %2 ===1){
  console.log(arr4[m])
 }

}

// // 5. перебрати циклом while та вивести  числа тільки парні  значення (ззаду на перед)
 let b2 = arr4.length;
 while (b2--){
 if (arr4[b2] %2 === 0){
  console.log(arr4[b2])
  }
 }
//
// // 6. перебрати циклом for та вивести  числа тільки парні  значення (ззаду на перед)
 for (let j2 = arr4.length; j2 >= 0; j2--) {
 if(arr4[j2] %2 === 0){
  console.log(arr4[j2])
 }
}

 // 7. замінити кожне число кратне 3 на слово "okten" (ззаду на перед)
for (let j3 = arr4.length-1; j3 >= 0; j3--) {
 if(arr4[j3] %3 === 0){
  arr4[j3] = "okten"
  console.log(arr4)
 }
}

// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор