// - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
let x = +prompt('введіть число');
if (x !== 0){
    alert('Вірно');
}else {
    alert('Невірно');
}

let a = +prompt('введіть число');
if (a !== 0){
    document.write('Вірно'+ "<br/>");
}else {
    document.write('Невірно' + "<br/>");
}

//
// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
 let time = +prompt('ведіть число хвилин');
if (time > 0 && time <= 14) {
    document.write('це є 1 чверть' + "<br/>");
}else if (time > 14 && time <= 29){
    document.write('це є 2 чверть' + "<br/>");
}else if (time > 29 && time <= 44) {
    document.write('це є 3 чверть' + "<br/>");
}else if (time > 44 && time <= 59){
        document.write('це є 4 чверть' + "<br/>")}

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
let day = +prompt('введіть число дня');
if (day > 0 && day <= 10){
    alert('це 1 декада місяця')
}else if (day > 11 && day <= 20){
    alert('це 2 декада місяця')
}else if (day > 21 && day <= 31){
    alert('це 3 декада місяця')}


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).
//
let dayOfWeek = prompt('Ведіть день тижня');
switch (dayOfWeek){
    case 'понеділок':
        console.log('йди на роботу');
        break;
    case 'вівторок':
        console.log('практичне заняття');
        break;
    case 'середа':
        console.log('слухай лекцію');
        break;
    case 'четвер':
        console.log('виконуй практичну роботу');
        break;
    case 'пятниця':
        console.log('заняття у басейні');
        break;
    case 'субота':
        console.log('прибирай у домі');
        break;
    case 'неділя':
        console.log('відпочивай');
        break;
    default:
        console.log("Ти щось не то ввів");
}


//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

let number1 = +prompt('Введіть перше число');
let number2 = +prompt('Введіть друге число');
if (number1 > number2){
    console.log(number1)
}else if ( number1===number2){
    console.log('Введенні числа рівні')
}else {
    console.log(number2)
}


//     - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//         за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподыбне, тобто кастується до false)
let b = +prompt('Введіть будь-яке значення');
if (b === undefined || b === null || b === " " || b === 0 || b === false || b === NaN) {
    b = "default"
    console.log(b)
}else {
    console.log(b)
}